Revit 2024 API
Face.GetSurface Method
Returns a copy of this face's surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public Surface GetSurface()
Visual Basic
Public Function GetSurface As Surface
Visual C++
public:
Surface^ GetSurface()
Return Value
 A copy of this face's surface.
See Also
Face Class
Autodesk.Revit.DB Namespace